[
  {
    "episode_id": "(4,8)",
    "source": "imdb",
    "text": "Antoinette can destroy Larry and so he is trapped. She forgot to cancel his appointments, forgets to pick up packages, doesn't pick up the phone at the office and so on. Cheryl is frustrated since she and Larry haven't had sex in a long time.",
    "word_count": 45,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry and Jeff decide to buy a \"Girls Gone Wild\" video tape & get it delivered to Larry's office. That lands them both in the hot seat with Larry's secretary. When the video arrives, she has just had the breakup and hates the video that objectifies women in such an objectionable manner. Larry is afraid to fire her as she knows all of Larry's secrets, including his web of lies, his dietary habits, and knows more about Larry than Cheryl does. Antoinette can destroy Larry and so he is trapped. Cheryl is frustrated since she and Larry haven't had sex in a long time. Jeff brings condoms for Larry and claims that with these condoms he is never going to stop.Larry's secretary starts getting worse in her job. She forgot to cancel his appointments, forgets to pick up packages, doesn't pick up the phone at the office and so on. She seeks Larry's advise if she should call her ex-boyfriend, all of which make Larry even more angry. Larry unloads his frustration at his secretary, who quits and vows to unravel every lie and deceit that Larry has ever pulled in Hollywood. She vows to expose Larry.The only way Larry can salvage the situation is by getting his secretary back together with her boyfriend. He finds out that the problem they have is that her boyfriend finishes fast in sex.Jeff and Larry watch the video at Jeff's house & Jeff's dog leaves the house during the viewing of the tape. Jeff & Larry get in Larry's car to search for Oscar. Larry almost runs into Oscar, & Jeff is unsure whether Oscar is OK or not. Oscar has no visible signs of any injuries. Later, Susie figures out that Oscar is all lethargic. Larry tells Jeff not to tell Susie about the accident with Oscar. Susie takes Oscar to the vet who says that Oscar's voice-box is squeezed as it someone was trying to strangle him. Susie suspects that Larry attacked Oscar for biting his penis.Suzie takes Oscar to the vet who tells her that his voice box is damaged. Meanwhile, Larry seeks the help of his native American gardener, Wandering Bear (Russell Means), to cure Cheryl of a feminine problem (she has a numb vagina) after Larry mistakenly wears a condom inside out, which had a numbing agent to sedate the male penis, but got applied to the vagina in this case. Wandering Bear is a shaman of his tribe and knows all about plants and herbs and their medicinal effects. Wandering Bear writes the name of a root, which solves Cheryl's problem. But later Cheryl realizes that Larry told the gardener about her vaginal issue.Larry talks to Wandering Bear about not talking to Cheryl about her vagina. Wandering bear tells Larry that a white doctor would not only ask, but also look at the vagina, before curing it. Larry gives the condom to his secretary's boyfriend, which will solve his premature ejaculation problem. Wandering Bear had worked for Susie and she owed him money, which he goes to pick. Susie refuses to pay him, as she says that she has already paid him. When Wandering Bear refuses to leave, Susie calls Oscar. Wandering Bear offers to cures Oscar which she accepts. Oscar, now cured, goes after Larry for crushing him with his car."
  },
  {
    "episode_id": "(6,6)",
    "source": "imdb",
    "text": "But Larry would rather feel her breasts than eat toast, much to Cheryl's disgust. He also tries to explain the misunderstanding with Hal.She accepts his apology and beats a hasty retreat. Leon gets overexcited by the idea and Larry tries to back pedal but he's interrupted by a call from a telemarketer who, much to his frustration, won't take no for an answer.",
    "word_count": 63,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry waits for his unbearably slow toaster while the kids get ready for school and Leon prepares for a job interview. Larry offers some advice: take control, turn it around on the interviewer. Leon gets overexcited by the idea and Larry tries to back pedal but he's interrupted by a call from a telemarketer who, much to his frustration, won't take no for an answer. When he hangs up, Leon notes they have the same cell phone.Cheryl calls out to Larry from bed. She's very sick and wants some attention. She tells him she can't go to Keysha's school production of 'Grease' and urges Larry to get someone to go in her place. Dropping the kids off at school, Larry runs into Susie who is talking to colored man named Hal (Tim Meadows) and his white, deaf wife, Jean (Deanne Bray). Susie translates Jean's sign language and Larry is impressed with her fluency. When Larry sees Jean's small dog in her bag, he says it looks \"half-rat,\" and Jean gets insulted and leaves. Larry tries to call out after her that she couldn't hear his tone, that he was joking, but it's too late. In the school restroom, he sees Hal and explains his joking tone about the rat dog comment. Hal suggests Larry stop by their house to make a face-to-face apology. As Larry dries his hands under the air dryer, he makes a gesture that apparently is insulting, and Hal storms out. At Jeff's, Larry explains his interest in sick sex. He also tells Jeff he's thinking of getting his father a happy ending massage and Jeff provides him with the name of a masseuse. When Susie comes in, Larry recreates the gesture he made to Hal and asks her to translate. \"You called Hal a c***sucker Larry!\" she informs him. Then, when Larry mentions he needs a date to see 'Grease' at the middle school, Mike (Kevin P. Farley), the Greene's exterminator, overhears and says he'd love to go. Cornered, Larry agrees to the date.The next morning, Leon reports that his interview went well: \"I'm a flipping a** right now!\" Today, Loretta has a job interview and Larry's offered to drive her. But first, his father, Nat (Shelley Berman), stops by and reports that he had a wonderful massage and is now in love with his masseuse Lisa (Dorian Frankel) because of the special love she showed him, and he wants to buy her a present. Before Larry can set him straight, Cheryl calls out for him. She wants wheat toast. Larry balks, saying the toast will take \"a year\" and Loretta has an interview, but Cheryl insists, accusing Larry of not caring about her. Larry runs down to make toast, pausing Leon's toast to do so. When he brings her limp bread instead of toast, Cheryl rejects it but Loretta is shouting for him that she's late and he has to go. He grabs the wrong cell phone as he runs out.An hour late to her interview, Loretta loses the job and is angry. Blaming the toaster, Larry insists they buy a new one. At the store, Larry sees Loretta checking out a cute guy and comments, but Loretta claims he's not her shade. Larry spots Jean shopping and goes over to apologize. Talking loudly and gesturing broadly, he gets his message across that he was joking about her dog looking like a rat. He also tries to explain the misunderstanding with Hal.She accepts his apology and beats a hasty retreat. But later, when Larry is explaining to his father that he hired the masseuse to give him a happy ending, Jean sees Larry making a yanking gesture from across the store and is again offended. Larry leaves a message for Hal to call him on his cell so he can explain this latest misunderstanding.Larry gets a call on his cell phone, intended for Leon, by a man \"prepared to make you an offer.\" Thinking it's a telemarketer, Larry tells him off, and Leon loses the job. Meanwhile, Hal calls Larry's cell to tell him off for offending Jean yet again and gets Leon. Hal is outraged, thinking Larry is putting on a colored guy character to make fun of Hal and hangs up in a rage.Leon realizes he has the wrong phone and points this out to Larry. But Larry denies that Leon got a call about a job and Leon denies he answered a call from Hal. When Mike arrives to be Larry's date for 'Grease,' Leon questions him at the door like an overprotective father, while the two men wait for Larry. Larry finally comes down and they head off to the play. Larry and Mike take their seats between Nat and the masseuse Lisa, and Susie and Jeff. But before the show starts, Jean stomps up and causes a scene, angrily signing to Susie that Larry made racist comments to Hal on the phone. When Jean's dog escapes in the auditorium, Nat yells \"it's a rat!\" Mike springs into action to exterminate it and stomps it to death before Lisa stops him with her screams \"It's a dog!\" The audience flees, horrified.Mike drops Larry off at home, the night having been a bust and shake hands at Larry's front door as they part ways. Using the new toaster, a recuperated Cheryl makes toast for Larry, who is now sick. But Larry would rather feel her breasts than eat toast, much to Cheryl's disgust."
  },
  {
    "episode_id": "(7,10)",
    "source": "imdb",
    "text": "Larry is hopeful that his plan is working when Cheryl invites him over to review the 'Seinfeld' reunion script. He accuses Susie of putting stains on Julia's table, and Susie throws him out of the house. Joe makes Larry pay him to not press charges against Jason's dogs.",
    "word_count": 48,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry is hopeful that his plan is working when Cheryl invites him over to review the 'Seinfeld' reunion script. Cheryl wants Larry to coach her on her tone. While talking to Cheryl, Larry asks Mocha Joe (Saverio Guerra), a coffee delivery boy at the studio, to deliver some jumper cables to another actor. Joe is offended that Larry didn't offer him a tip for this task. Jerry tells Larry about this slight to Joe at Jason's book signing in the evening. Larry argues that he asked Mocha Joe for a favor and a favor implies no tipping. Jason has launched a book called \"Acting Without Acting\". Larry is supposed to head to Cheryl's right after the book signing. At the event, Julia, who is hosting the party, calls on Larry and scolds him for putting his wet glass on her antique table without a coaster. She wants Larry to pay $500 to fix the table. Larry says that he never put his glass down on the table. Larry promises to find out who left the stain on Julia's table. Mocha Joe is also at the party, providing drinks to all the guests.Larry attempts to right a wronged Mocha Joe. Joe asks Larry to return the favor by going to west Hollywood and to pick up the coffee supplies for the next day. Larry tries to tip Mocha Joe instead, but now Joe insists that Larry has to do him a favor, like he promised. This causes Larry to miss the date, and Cheryl ends up turning to Jason for coaching. The coffee shop in Hollywood was closed by the time Larry got there and the next day Mocha Joe is angry since Larry failed to return the favor.Larry complains to Jeff about Cheryl working closely with Jason and notices stains on Jeff's table left by Susie. He accuses Susie of putting stains on Julia's table, and Susie throws him out of the house. Larry starts to change the scenes in the reunion show, where Jason and Cheryl are supposed to be physically close to each other. The changes make no sense and Jerry talks to Larry about it. Larry finds Jason's car, with tinted windows, bouncing and thinks he is having sex with Cheryl. He opens the car, which lets his dogs out, which attack Mocha Joe. Joe complains to the studio, who order Jason's dogs to be terminated. Jerry asks Larry to pay Mocha Joe, so that he doesn't press charges. Larry asks Joe for a favor and not press charges against Jason's dogs. Joe makes Larry pay him to not press charges against Jason's dogs. Larry finds stains on Jerry's table and now accuses him of staining Julia's table.A jealous Larry rewrites the end of the 'Seinfeld' reunion show and Jason quits in protest. According to the new ending, George and Amanda are not going to end up together. Larry insists he can play George, but the cast hates his interpretation of George's character. Larry quits, Jason re-joins, and Larry watches the reunion show alone at home. He is stunned to discover that the role of Amanda, George's ex-wife, is now being played by Virginia (whose neck is better).Just then the doorbell rings: It's Cheryl, explaining she quit too, because it wasn't the same without Larry. They watch the show together, agreeing that George and Amanda belong together -- as do they. At that precise moment, Larry notices that Cheryl has a cold coffee in her hand which left a stain on his table. He finally figures that it was Cheryl who left the stain on Julia's table and wants her to apologize to Julia. Cheryl is exasperated."
  },
  {
    "episode_id": "(9,9)",
    "source": "imdb",
    "text": "Jeff says that all Susie wants to do is to have sex, and Jeff has to keep the hat on, while they are having it. Larry takes the tickets.Jeff begins wearing the cowboy hat that the Shucker left at Larry's house, which turns Susie on. Larry and Mrs.",
    "word_count": 48,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry's Fatwa is revoked, and his musical is back on, but only if Lin-Manuel Miranda is involved. At a dinner party at Larry's house, the oyster Shucker (Steven Weber) overhears Larry say he fell asleep during Hamilton (The show in which Lin performs in LA). Larry is afraid that the Shucker will blab about Larry's comments all over town and the news might reach Lin in some way. In his exchange for his silence, the Shucker demands 2 tickets to Hamilton. The Shucker directly threatens that Lin would find out that Larry fell asleep during his show.Larry and Jeff meet with Lin to discuss the musical, and Larry ends up giving in to all of Lin's creative demands. Jeff is surprised that Larry gave in to everything without a single peep. Lin wants to do the show in LA and not Broadway. Lin gets tickets for Larry, but only after Larry says they're for him, after originally requesting tickets for his Shucker. Lin had said he could not get the tickets for the Shucker but would get them if Larry himself wanted to go. Larry takes the tickets.Jeff begins wearing the cowboy hat that the Shucker left at Larry's house, which turns Susie on. Jeff says that all Susie wants to do is to have sex, and Jeff has to keep the hat on, while they are having it. Jeff returns the hat to Larry as he cannot handle Susie anymore. After Larry gives back the hat to the Shucker, Susie spots him with the hat on, and they later have a short affair.Larry figures that he has ceded creative control to Lin-Manuel as he sits behind a high desk and has a \"deference\" authority because of it. Jeff and Larry decide to get Lin out from behind the desk. Lin wants to rewrite all of Larry's songs. Lin wants to rap with Larry's songs. Larry hurts his shoulder while trying to wrestle Lin-Manuel for control of the desk and Lin threw Larry to the ground.Larry gives the tickets to the Shucker. Lin calls Larry to say that he is in the show and now they will be working together all the time. Lin tells Larry he'll be sitting next to his wife at the show, so he'll know if Larry is there or not. Larry asks the Shucker to give him the tickets back, and he only agrees to sell them back to Larry for $2500. Larry has to pay.The previous owner of Larry's house, Mrs. Shapiro (Carol Herman), begins reappearing at the house, much to Larry's annoyance, and ends up stealing a dying plant. Mrs Shapiro says that she had left the Ficus plant with Larry in good faith, and now it is all dried up and wilting. Mrs Shapiro uses her own key to enter the house, and water the plant. She was able to use her key as Larry never changed the locks. Larry and Mrs. Shapiro go on Judge Judy, but Larry loses the case because now the plant is in much better condition.Larry learns that Bridget has been telling intimate details about her previous relationships. Larry also realizes that Cheryl has told intimate details about her time with Larry to Ted, and God knows who else. Larry tries to make Bridget sign a non-disclosure agreement while in bed. This doesn't go well, and Bridget breaks up with him.At the Hamilton performance, Larry ends up falling asleep next to Lin's wife Vanessa, after taking some pain pills for his shoulder that he got from Jeff. Jeff had to get the pills because his penis was hurting from having sex with Susie."
  },
  {
    "episode_id": "(9,10)",
    "source": "imdb",
    "text": "The next day, Larry is spotted by an Iranian man on the street, who doesn't know the Fatwa has been revoked, and begins chasing him. The woman gives Larry her card hoping for a call back, as she is an actress, but is asked to leave when Marty shows up. At the paintball game, Larry expresses his frustration over Lin's family, saying that they abused his hospitality.",
    "word_count": 67,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry and Jeff watch the rehearsals for Fatwa! which are going great. Jeff, Marty, Ted and Richard have invested heavily in the musical. Larry plans a paintball game for the cast and crew, which gets him many thank-you. Larry even pays a crew member Cody Gutcher (Nick Offerman) $1200, which he would have made at another gig the same day, so that he can join the crew. Later Larry realizes that the crew member would have made only $700 after taxes and fleeced him for $500.Larry has dinner reservations with Jeff, Susie and Marty, but the hostess refuses to seat them because Marty isn't there yet. In response, Larry asks a random woman Marie Deschamps (Casey Wilson) to join them as a stand-in. The woman gives Larry her card hoping for a call back, as she is an actress, but is asked to leave when Marty shows up. Larry expects a large apology from Marty, but he rebukes Larry saying that Larry killed Marty's family (Kenny)Lin and Larry get into a creative argument over a scene that Lin doesn't think is working, but Larry believes it's because the attractive sign language interpreter with large breasts is causing a distraction. Lin puts his foot down saying that the interpreter will stay. Lin says that having the sign language interpreter makes the show more inclusive. Larry says that men will look at large breasts over anything else in the world. Larry clashes with F. Murray Abraham, who plays the Ayatollah, when he thinks Murray is \"outfit-tracking\" him because he wore the same pants two days in a row.Larry agrees to let Lin's cousin Valentina (Tipper Newton) and her husband Ernst stay at his house. Their AirBnB booking fell through, and they don't want to stay at a hotel. Lin is himself renting a house, still asks Larry to host Valentina and her husband, which he agrees to. Larry is dissatisfied with Lin's \"thank you\". Larry and Lin continue to clash over the quality of Lin's sorry' s and thank you' s.Unbeknownst to Larry, the couple are swingers and end up trashing Larry's house. Larry meets Victor's parents Lisa (Antoinette Abbamonte) & Paul Chesnick (Anthony Natale) who are deaf and dumb. His parents decide to hire an interpreter for the wedding, and it is the same large breasted woman. The day of the paintball game is the same day as Sammi's wedding, but Larry promises to be there because he is delivering a speech.Due to Murray, Larry buys a new pair of pants, which are not a good fit and keep sliding off his waist. At the paintball game Larry speaks to Cody and asks him for $500 back. The crew member calls him a prick and refuses to give the money back. At the paintball game, Larry expresses his frustration over Lin's family, saying that they abused his hospitality. Larry says they trashed his house and broke his curtain remote. Lin challenges him to a paintball duel, where Larry accidentally shoots him in the mouth. Larry and Lin walk to their positions, Lin was going to fire in the air, and so was Larry. But Larry's pant slipped and he ended up grabbing it, so his other arm came down and he shot towards Lin's mouth. Larry accompanies him to the hospital and misses Sammi's wedding. The large breasted woman causes a distraction at Sammi's wedding and Susie has to kick her out.Larry calls the stand-in actress, the woman he met at the restaurant, who was standing in for Marty when he was late and has her make his speech at the wedding.Due to Lin's injury, he cannot perform for six months, which puts an end to the musical. All the investments are gone, and Jeff has to sell his house. The next day, Larry is spotted by an Iranian man on the street, who doesn't know the Fatwa has been revoked, and begins chasing him."
  },
  {
    "episode_id": "(7,7)",
    "source": "imdb",
    "text": "Mr Takahashi (Dana Lee) is the Owner of the club and confronts Larry. The gravestone reads \"Past Away\" instead of \"Passed Away\". Larry decides to protest this policy of an additional tip.He breaks the club's rule that mobile phones must be switched off when he forgets to turn off his BlackBerry.",
    "word_count": 51,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry is playing golf with Jeff, Marty and Andy. They see Norm at the restaurant and want to hurry as Norm is the slowest golfer in the world. Everyone orders a quick meal, but Andy wants an elaborate sandwich with caramelized onions, which takes a long time to prepare. As a result, Norm finishes his lunch before and gets on the golf course. At his golf club, Larry berates Norm (Paul Mazursky) for playing slowly; Norm had been looking for his ball for 20 minutes on the course. Norm and Larry get into a shouting match. Norm dies of a heart attack on the same day, which Larry is blamed for. Jeff says it is not murder, but certainly qualifies as involuntary manslaughter.Larry criticizes the club's unorthodox tipping policy at its restaurant. The restaurant already includes a 18% tip in the bill, and then leaves space for an additional tip. Larry decides to protest this policy of an additional tip.He breaks the club's rule that mobile phones must be switched off when he forgets to turn off his BlackBerry. Mr Takahashi (Dana Lee) is the Owner of the club and confronts Larry. Larry says that his father had a quadruple bypass surgery and hence had to take the call. Takahashi warns Larry.He seeks to correct a spelling mistake on his mother's gravestone. The gravestone reads \"Past Away\" instead of \"Passed Away\". Nat (Shelley Berman) says that he misspelled it on purpose since it cost $50 per letter to get it engraved. Larry engages the stonemason to get it corrected. But they have an argument about Larry's favorite ball-player.Larry offers to pay for his cousin Andy's daughter Skylar's college tuition fees. But now Andy wants Larry to help sell his wife's hats to his celebrity friends.The next day Larry and his gang go another game of golf. The course is empty out for respect for Norm. Larry kills a black swan with his golf club when it flies close to him. The Black Swan was Mr Takahashi's pet swan. They bury the swan in the woods. The cleaning crew of the course discover the dead swan buried in the woods. While the gang is having lunch, they see that Mr Takahashi has been made aware of the Swan's death. Marty, Jeff and Andy all turn against Larry and accuse him of not following the club rules. Mr Takahashi summons all 4 to his office. They were the only people on the course that day. Takahashi knows that one of the 4 killed his pet black swan. Larry and Takahashi have a staring contest, which is broken when Larry again gets a call on his Blackberry.Andy says that his wife wants to go to Cosmetology school. When Larry refuses, his wife threatens to reveal that Larry killed Takahashi's Black Swan. Larry is being blackmailed to send Andy's wife to Cosmetology school.At Norm's funeral, Larry is badmouthing the stonemason to Marty, not knowing that the stonemason is standing right next to Marty. The mason is angry to know Larry's views about him. Larry's phone rings during the funeral. Larry tells Norm's wife (Mary Gregory) that the Black Swan killed Norm. The waiter finds Larry's Blackberry which had an email from Jeff about the killing of the Black Swan and how Jeff wanted to confess. It is the same waiter to whom Larry refused the additional tip. Larry is afraid that the waiter will squeal and gives him a $500 tip. Mr Takahashi finds out about Larry's tip to the waiter and concludes that such a generous person could not have been the swan killer.Later, Larry and Takahashi walk over to his mother's grave (which was at the same cemetery as Norm), and find that stonemason has carved \"Swan Killer's Mother\" on her tombstone"
  },
  {
    "episode_id": "(7,6)",
    "source": "imdb",
    "text": "Maureen accuses Larry of targeting her since she is a woman. Larry slips and is only saved by hanging on to Maureen's bare midriff. The painting was hung in the bathroom and Larry splashed urine on the painting as the toilet seat was at an odd angle.",
    "word_count": 47,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry and Jerry have problems with their assistant Maureen (Jillian Bell), who always wears clothes that expose her large abdomen. They can't fire her as Julia got her the job. Jerry and Larry both want the other to speak to Maureen to sort out her dressing issues. They do odds and evens, and Larry loses. He has to speak to Maureen.Larry talks to Maureen about covering up her bare midriff. Maureen accuses Larry of targeting her since she is a woman. She alleges that Larry would never single out a man if he bared his midriff. Maureen believes that Larry is offended by her body. She says she has lost 68 pounds in 2 years and now wants to flaunt her new body. Larry argues that she can wear whatever she wants outside the office. Maureen quits and Larry is happy as that is what he and Jerry were hoping for.Jerry tells Larry that Meg Ryan's schedule is too tight, and she won't be able to play George's wife for the reunion show. He suggests Lisa Kudrow instead. Larry says that he wants to go with someone unknown for this part, to make it more real. Larry suggests Cheryl. Cheryl is an unknown and has lived this part. Jerry agrees to let Cheryl read for the part.Larry, Jerry and Richard have lunch together. Richard is offended when Jerry and Larry cannot decide who would Scooch over to make place for Richard to sit. Larry and Jerry run into Cheryl, and Cheryl thanks Jerry for giving her the part in the Seinfeld reunion. Larry tells Cheryl that she has to audition for the part. Julia confronts Larry and says that Maureen's mother was a nanny to her kids for several years. She is mentally unstable and Maureen getting fired can push the mother to suicide.Larry visits Maureen and asks her to come back to work. Maureen's mother meets Larry and says that Larry is a splitting image of her late husband Tom. Tom was murdered in a road rage incident when he confronted the driver of a car that cut in front of him. The guy took out a tire iron from the boot and beat Tom to death. All Tom did was honk his car horn.Larry accidentally splashes his urine onto Maureen's mother's painting of Jesus. The painting was hung in the bathroom and Larry splashed urine on the painting as the toilet seat was at an odd angle. This is later misinterpreted by Maureen's mother as a miracle of making tears flow from Jesus' eyes.Richard calls Larry and says that he has a Joe DiMaggio bat for him as a gift. The call drops and Larry never calls him back, which again offends Richard. Maureen tells Larry and Jerry about the miracle and decide to quit. She wants to tour the whole country and display the miracle. Larry agrees to be a co-signer for a camper that Maureen wants to rent. Larry tells Jerry that he splashed the painting with urine.Larry buys a sandwich from a restaurant and takes too many napkins. The owner admonishes Larry and asks him to take only 2. Larry takes them anyway. The owner reports Larry to the police and Larry is arrested for stealing napkins from the restaurant. Larry is eventually released as the owner cannot pick Larry in a line-up.As a result, Larry misses the co-signing of the camper lease. Larry picks up Maureen's mother to go for the signing. Richard's car cuts in front of Larry, and Larry makes him pull over. Richard is angry about not getting an official goodbye on the call. They argue, and it reminds the mother of her husband's murder. Richard wanted to give the baseball bat to Larry. But she deliberately drives the car at Richard, wrongly assuming he is about to beat Larry up.Larry drives to Maureen's house, but finds it locked. He has to relieve himself and goes behind the bushes. That when Maureen and her mother drive up and see the urine splashing in all directions. That when Maureen realizes that the tear was not a miracle, it was Larry's urine. Maureen's mother goes to the roof to jump. Larry and Maureen follow to save her. Larry slips and is only saved by hanging on to Maureen's bare midriff."
  },
  {
    "episode_id": "(9,3)",
    "source": "imdb",
    "text": "Larry had thought of Jason (Jason Alexander) portraying Salman in the Fatwa musical, but Salman is offended at the idea and wants Hugh Jackman. Larry takes his advice to live normally and removes his disguise. Larry warns Ted about the aggressive beep of his new Tesla, and Ted ignores him.",
    "word_count": 50,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry is annoyed at a restaurant manager (Rich Fulcher) who refuses to tell him the specifics of the \"disturbance\" in the kitchen, which is causing his and Jeff's food to be delayed. Larry goes back into the kitchen to figure out what it is. Even the chef won't tell him what the disturbance was. Jeff tells Larry that Ted and Cheryl are dating regularly now.Susie is worried about her \"little sister\" Katie (Eryn Nicole Pablico) (Susie is in a mentoring program) who has gone missing and not returned home. Katie was staying with Susie for the duration of the program. Jeff and Larry come to Susie's home and find Ted and Cheryl there. Ted has a new Tesla. Ted and Cheryl confront Larry about following them at the hotel. Larry's sunglasses are also missing, and he cannot find them anywhere.Larry is given a ticket for $275 after he honks at the police car, while he was driving the Tesla he borrowed from Ted, that stopped in front of him at a green light. The beep was a bit aggressive in nature, even though Larry barely touched the horn. Larry contests the ticket in court, but loses, at least partly because of his behavior. Larry Yohoo's a judge when the judge ignores him. Larry's friends are avoiding him because of the Fatwa. His friends don't turn up for poker night. Golf day is canceled, which angers Larry. Larry warns Ted about the aggressive beep of his new Tesla, and Ted ignores him. within a week Ted is beaten up by a red neck when the red neck dozes off at a red light and Ted beeps him in his Tesla, which is mistaken for an \"aggressive\" beep.Larry seeks advice from Salman Rushdie (played by himself) about his Fatwa situation. Larry takes his advice to live normally and removes his disguise. Salman says that the Fatwa wrapped around Larry is a like a sexy Pixie dust, but he has to stop acting like a coward. As Rushdie predicts, he becomes very attractive to women because he's \"dangerous,\" and catches the attention of actress Elizabeth Banks. Salman had told Larry that Fatwa sex is the best & the perfect excuse not to do things you don't want to do. You just say, \"sorry, can't make it due to the Fatwa\". Larry had thought of Jason (Jason Alexander) portraying Salman in the Fatwa musical, but Salman is offended at the idea and wants Hugh Jackman. Larry says Salman is delusional.Larry goes back to Jeff's to find his sunglasses. Elizabeth offers to help find Katie by posting a photo of her on her Twitter account as Elizabeth has a lot of followers. The cop that wrote Larry the ticket, found Katie and brought her back home where Larry was showing off Elizabeth to Susie. On Katie, Larry finds his sunglasses that Katie had taken with her. On Jeff's roof, Larry notices Jeff's baseball cap and tries to get it down with a rake but ends up damaging the cop car. He runs away with Elizabeth. The cop chases Larry and Elizabeth. Larry asks Elizabeth to lie, and she gives a terrible performance, and the cop takes Larry away for booking."
  },
  {
    "episode_id": "(7,5)",
    "source": "imdb",
    "text": "When Denise first saw Larry, he was wearing a cap. Larry later receives a message from John that Jamie does not want him to attend the recital.But later, they see Larry in the restaurant on a date with Denise, and invite him back to the recital, along with Denise.Larry goes to the beach with Jeff, Susie and Sammi. Later, Larry realizes that Denise uses a wheelchair as at that point, he is unable to back out of the relationship.",
    "word_count": 79,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry begins dating a disabled woman, Denise (Anita Barone), who uses a wheelchair. Larry meets Denise at a cafe, and they start talking. Later, Larry realizes that Denise uses a wheelchair as at that point, he is unable to back out of the relationship. They are both Kim Chee Yun fans and Larry says that he is going to attend a private recital at a friend's house. They decide to go on a date, prior to the recital. At the beginning, things are rough. They go to a restaurant which is not disabled friendly, and Larry has to carry Denise up the stairs with great difficulty. Larry was starving and didn't want to go to a different restaurant. When Denise first saw Larry, he was wearing a cap. But when he came to pick her up, she realized that Larry is bald. Denise is disappointed that Larry misrepresented himself. Larry retorts that he didn't know that Denise used a wheelchair. Denise invites Larry in her house at the end of the date. Larry has an awkward time as he tries to kiss Denise from various positions while she is sitting on her wheelchair. Eventually they get to the bedroom, but Larry cannot seem to get Denise excited. Larry cannot decide if he did anything wrong or was it because of Denise's condition.Larry has a physical confrontation with Rosie O'Donnell (Rosie O'Donnell) when they have lunch together and Rosie tries to pay the bill. Larry says that Rosie came on his invitation and hence he should pay the bill, while Rosie says she had the bill in her hand, so she pays. They both get into a wrestle and have to be separated by other customers. Rosie goes around town telling everybody that she beat Larry in a physical fight.Larry is cornered into another date with Denise, as he cannot break up with a handicapped person over the phone. He is pleased at the advantages of having a wheelchair-using significant other, including being given priority in restaurants. Larry decides not to break up with Denise. They run into Ted Danson who sends a pie to their table but feels insulted when Larry and Denise send the pie back as they are too full.They plan to attend a Kim Chee Yun recital being held by Larry's friends Jamie Fowler (Jamie Denbo) & John Fowler (John Ross Bowie). John and Jamie have just adopted a girl of Chinese descent and Larry wants to know if the girl has a natural affinity to using chopsticks. Larry later receives a message from John that Jamie does not want him to attend the recital.But later, they see Larry in the restaurant on a date with Denise, and invite him back to the recital, along with Denise.Larry goes to the beach with Jeff, Susie and Sammi. Jeff and Susie go for a walk and leave Larry to look over Sammi. Larry plays bricks on his blackberry as Sammi ventures into the ocean and starts to drown. Jeff rescues Sammi from the ocean. Susie throws Larry's Blackberry into the ocean. Larry cannot contact his new date after Susie throws his BlackBerry into the ocean. Larry and Leon decide to drive around LA to try and find Denise. Trying to find Denise, Larry meets another wheelchair-using woman, Wendy (Amy Pietz), whom he takes instead.After arriving with her, Jeff shows him that Denise is also present, which leads to both women confronting Larry. Larry climbs up the stairs to escape the 2 women, but is then chased by Rosie, who still has a score to settle with Larry."
  },
  {
    "episode_id": "(7,9)",
    "source": "imdb",
    "text": "The greeter takes the $20 note that Larry had in his hands to buy a magazine. Larry was supposed to hook Michael with his doctor, whom he later realized was dead for 2 months. Larry has a greeter at his restaurant who gets him a table for a tip of $20.",
    "word_count": 51,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "The Seinfeld reunion kicks off rehearsals and Julia and George express their surprise that Cheryl landed the role of George's ex-wife. They both think Larry and Cheryl are back together. Marty shows up to the show and Larry asks him to leave, saying that it would bother Jerry. Marty asks Larry to check with Jerry, who is actually fine either way. Larry says that there is an unwritten rule that nobody from outside the crew is allowed on the sets. But Jerry says that he doesn't want to stand in the way.One of the producers Stacy introduces Larry to her 9-year-old daughter Emma (Sierra McCormick) and tells him that Emma is suffering from a \"rash on her vagina\". Emma strikes up an unwanted friendship with Larry via text messaging. Larry is irritated by this and talks to the producer, asks her about how Emma's vagina is doing. Jerry is aghast that Larry asked this question to Stacy. Eventually, as Emma keeps texting Larry, Larry ends up yelling at Emma (with all caps in his reply) and now her producer mom is super upset with Larry. Jerry asks Larry to take her & Emma out to lunch.The table read starts and Cheryl does well. The plot involves George losing all of his with Bernie Madoff, in a scheme to launch an iPhone application based on finding the nearest toilet to your current location. Elaine is a mother, but Jerry donated the sperm. Cheryl's character didn't lose her half of the money as she took it out before the bust. Larry is irritated by Jason Alexander's weird habit of putting Larry's pen that he borrowed prior to the table reading, in his mouth, ears and even scratching his chest with it. After the reading Larry refuses to take back the pen from Jason and ends up offending him. Larry tells Jason to get him a new pen. Jason gives Larry a cheap pen the next day, to which Larry objects.Meanwhile, Larry enlists Leon to ease Michael Richards's fears about his newly diagnosed Groat's disease. Larry was supposed to hook Michael with his doctor, whom he later realized was dead for 2 months. So, when Michael checked again, he gets Leon to play the doctor.Larry and Cheryl start bonding on the sets. Larry has a greeter at his restaurant who gets him a table for a tip of $20. The next day, Larry meets him outside of the restaurant and shakes his hand. The greeter takes the $20 note that Larry had in his hands to buy a magazine. The following day, Larry goes to the restaurant and doesn't tip the greeter. He explains to the greeter that the money the previous day was not for him, but for a magazine. The greeter is upset and then Emma and her mom come to join him and now the entire staff decides to ignore Larry's table. Due to the delay at lunch Larry is late to the meeting between Leon and Michael. Leon freelances it & sells his hat to Michael as cure for groats.Larry starts itching all over and suspects it's from Emma who hugged her at the restaurant after Larry gifted her a pen that he got from George (the cheap pen). Then the dead doctor's wife appears on the sets with Marty and Michael greets her. She tells Michael that her husband has been dead for 2 years. Michael confronts Leon in the parking lot but has to back away as people are taking videos of him. Finally, Larry goes to the doctor and tells him about how he got the rash from a 9-year-old who hugged him. The doctor calls the police as he thinks Larry is a pedophile."
  },
  {
    "episode_id": "(8,4)",
    "source": "wikipedia",
    "text": "Larry's has a fling with Heidi, an attractive woman who works at a restaurant which he frequents. Jeff invents an ill-fated excuse to get out of a dinner engagement, causing Susie to wrongly believe that Jeff is having an affair with Antoinette's mother when Susie sees Jeff hugging her. Larry also has a dispute with next-door producer Dino \"Big Dog\" (Harry Hamlin) over cabinet boundaries.",
    "word_count": 65,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry's assistant Antoinette is on leave to take care of her ill father, causing chaos in Larry's office. Larry also has a dispute with next-door producer Dino \"Big Dog\" (Harry Hamlin) over cabinet boundaries. Larry later convinces Antoinette to come back to work for one day, but her father dies on the same day. Larry's has a fling with Heidi, an attractive woman who works at a restaurant which he frequents. She borrows $60 from him and he is annoyed at her not repaying it, as well as her using smiley faces in text messages to him. She responds by drawing a smiley face on his head in sunblock, causing Larry to attend Antoinette's father's funeral with a smiley-face tan; Antoinette's mother later agrees to work as Larry's assistant. Jeff invents an ill-fated excuse to get out of a dinner engagement, causing Susie to wrongly believe that Jeff is having an affair with Antoinette's mother when Susie sees Jeff hugging her."
  },
  {
    "episode_id": "(12,1)",
    "source": "wikipedia",
    "text": "Leon tags along and receives a butt-dial from Larry's cell phone. Larry goes to return Leon's aunt's glasses and ends up getting arrested for giving her water while she is in line to vote. At the party, Larry angers several people and the fan does not want to pay the appearance fee.",
    "word_count": 52,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry has been contracted to go to Atlanta to appear at the birthday party of a wealthy fan, and Maria Sofia, the breakout star of his show, Young Larry, is going as well. Leon tags along and receives a butt-dial from Larry's cell phone. Maria arrives at the airport with her dog, who Leon fat-shames. In Atlanta, the maid at the hotel is upset by the state of Larry's room but he promises to leave her a generous tip. Larry, Maria, and Leon visit Leon's aunt who wrecks Larry's glasses, but due to them having a similar prescription, she loans him a replacement pair. Larry then drops his own glasses into the toilet at the hotel and argues with the maid about who should retrieve them. Later, while cleaning his pants, Larry doesn't notice that he blows a ten-dollar bill into the toilet and the maid assumes it is her tip and grows angry and throws Larry's things out the window. At the party, Larry angers several people and the fan does not want to pay the appearance fee. Larry manages to straighten it out, but when Maria's dog accidentally dials the man's phone number, he overhears Larry talking trash about him. Larry goes to return Leon's aunt's glasses and ends up getting arrested for giving her water while she is in line to vote."
  },
  {
    "episode_id": "(4,2)",
    "source": "wikipedia",
    "text": "Michael breaks up with her, but blames Larry for the breakup and guilts him into helping with several tasks. Ben is perturbed that Larry did not bring a gift (despite him telling attendees not to bring gifts) and that he refuses to sing \"Happy Birthday to You\". Everyone leaves, except Larry.",
    "word_count": 51,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry meets the show's blind piano player Michael, who he and Richard helped move in 2000. Michael has a below-average-looking girlfriend who has tricked him into believing she is a beautiful model. Michael asks Larry if he thinks she is beautiful, to which he says she is not. Michael breaks up with her, but blames Larry for the breakup and guilts him into helping with several tasks. At Ben Stiller's birthday party, Larry angers Susie by saying \"I love tits\" during a game of telephone with children, though Larry insists he was accurately repeating what the previous boy in the chain said. Ben is perturbed that Larry did not bring a gift (despite him telling attendees not to bring gifts) and that he refuses to sing \"Happy Birthday to You\". While demonstrating a golf swing, Larry accidentally stabs Ben in the eye with a wooden skewer. Richard's friend's attractive daughter, Kim, shows Larry her new breast implants by placing his hands on them. Cheryl sees Larry and Kim through a window and angrily tells Larry that he has used up his anniversary gift. At a bar, Michael plays the piano as he sings very badly. Everyone leaves, except Larry."
  },
  {
    "episode_id": "(10,4)",
    "source": "wikipedia",
    "text": "After borrowing a toothbrush off of Cheryl, Ted Danson arrives unexpectedly, and causes a scene when he sees Larry brushing his teeth in their bathroom. His room is much smaller than the others, the groom Mickey (Timothy Olyphant) will not let him borrow a toothbrush, despite having one extra, and he is charged an exorbitant amount for reporting a stain on a chair in his room. Ted starts a fight, causing the groom to loudly berate Larry, and Jeff when he supports Larry.",
    "word_count": 83,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "After Alice collapsed in the elevator in the previous episode, she loses her memory, thus forgetting her sexual harassment claim. Larry, Leon, Jeff, Susie, and Cheryl all head over to Cabo San Lucas for a friend's wedding on a private jet. Larry gets frustrated when no one will tell him their weight, despite it being a request of the pilot. Larry begins dating a new woman, Donna (Megyn Price), and invites her along, but is concerned when he sees an older photo and determines that she is a yo-yo dieter. Once at the resort Larry runs into numerous issues. His room is much smaller than the others, the groom Mickey (Timothy Olyphant) will not let him borrow a toothbrush, despite having one extra, and he is charged an exorbitant amount for reporting a stain on a chair in his room. After borrowing a toothbrush off of Cheryl, Ted Danson arrives unexpectedly, and causes a scene when he sees Larry brushing his teeth in their bathroom. Leon discovers the hotel's coffee is incredible, and after failing to buy some beans, he and Larry steal some to take back for use in Larry's coffee shop. At the wedding, Ted reveals that he knows that Larry slept with Cheryl. Ted starts a fight, causing the groom to loudly berate Larry, and Jeff when he supports Larry. On the plane ride home, Larry gives the pilot everyone's weight which he garnered from a carnival barker who guesses peoples weights and correctly guessed Larrys weight earlier in the night, but because of the beans, Larry cannot fly home himself, and is forced to watch everyone else leave on the plane."
  },
  {
    "episode_id": "(10,7)",
    "source": "wikipedia",
    "text": "Larry is disappointed at being repeatedly seated in the rear section of a restaurant among people he perceives to be ugly, until he can blackmail the maitre d' (Nick Kroll) into letting him sit near the windows with the good-looking people. Larry seeks to court a woman (Jane Krakowski) with an apparently magical vagina. She is the widow of his old golf buddy who killed himself days earlier due to disappointment from the many years of lackluster skills of the New York Jets.",
    "word_count": 83,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry is disappointed at being repeatedly seated in the rear section of a restaurant among people he perceives to be ugly, until he can blackmail the maitre d' (Nick Kroll) into letting him sit near the windows with the good-looking people. Larry seeks to court a woman (Jane Krakowski) with an apparently magical vagina. She is the widow of his old golf buddy who killed himself days earlier due to disappointment from the many years of lackluster skills of the New York Jets."
  },
  {
    "episode_id": "(7,2)",
    "source": "wikipedia",
    "text": "Larry is increasingly unhappy with Loretta's demands on him. Loretta decides not to see the doctor again because she thinks she sees her giving her husband a blowjob as he is driving. To increase the chance of that, he deliberately does several annoying things during the consultation.",
    "word_count": 47,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry is increasingly unhappy with Loretta's demands on him. He arranges an appointment for both of them with a doctor who is renowned for encouraging cancer patients to remove themselves from bad relationships, so that Loretta will leave Larry. To increase the chance of that, he deliberately does several annoying things during the consultation. Loretta decides not to see the doctor again because she thinks she sees her giving her husband a blowjob as he is driving. Larry refuses contact with Richard's new girlfriend because Jeff told him she recently gave Richard a blowjob in the car. Jeff crashes his car while receiving a blowjob from Susie. Leon is enjoying an affair with his friend's wife. When the friend comes to the house, Larry helps her hide from him in his car. Loretta sees this, and wrongly assumes that she is giving Larry a blowjob. Larry does not try to correct her, as she ends their relationship due to assuming he is cheating on her and the Blacks move out. However, Leon stays, which Larry is puzzled and disappointed about."
  },
  {
    "episode_id": "(9,10)",
    "source": "wikipedia",
    "text": "Larry plans a paintball game for the cast and crew, which gets him many thank-you's. Larry calls the stand-in actress and has her make his speech at the wedding. Unbeknownst to Larry, the couple are swingers and end up trashing Larry's house.",
    "word_count": 42,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry and Jeff watch the rehearsals for Fatwa!, which are going great. Larry plans a paintball game for the cast and crew, which gets him many thank-you's. Larry has dinner reservations with Jeff, Susie and Marty, but the hostess refuses to seat them because Marty is not there yet. In response, Larry asks a random woman to join them as a stand-in. Lin and Larry get into a creative argument over a scene that Lin doesn't think is working, but Larry believes it's because the attractive sign language interpreter with large breasts is causing a distraction. Larry clashes with F. Murray Abraham, who plays the Ayatollah, when he thinks Murray is \"outfit-tracking\" him because he wore the same pants two days in a row. Larry agrees to let Lin's cousin Valentina (Tipper Newton) and her husband stay at his house, and Larry is dissatisfied with Lin's \"thank you\". Unbeknownst to Larry, the couple are swingers and end up trashing Larry's house. The day of the paintball game is the same day as Sammi's wedding, but Larry promises to be there because he is delivering a speech. At the paintball game, Larry expresses his frustration over Lin's family, saying that they abused his hospitality. Lin challenges him to a paintball duel, where Larry accidentally shoots him in the mouth. Larry accompanies him to the hospital and misses Sammi's wedding. Larry calls the stand-in actress and has her make his speech at the wedding. Due to Lin's injury, he cannot perform for six months, which puts an end to the musical. The next day, Larry is spotted by an Iranian man on the street, who doesn't know the fatwa has been revoked and begins chasing him."
  },
  {
    "episode_id": "(11,7)",
    "source": "wikipedia",
    "text": "Larry attends a rally for mayoral candidate Jimmy Mayhew, which Susie is involved in. Larry tells Stan to take it easy on Asa because he was sexually abused when he was a younger actor. Asa, the actor playing young Larry, is very picky about the props being used on set and causes grief for Stan, the prop master.",
    "word_count": 58,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry attends a rally for mayoral candidate Jimmy Mayhew, which Susie is involved in. During a table read for Young Larry, Maria Sofia gives a terrible performance and Larry realizes he has to replace her. Asa, the actor playing young Larry, is very picky about the props being used on set and causes grief for Stan, the prop master. Larry tells Stan to take it easy on Asa because he was sexually abused when he was a younger actor. Stan reveals that Asa's \"trauma\" was that an older, very attractive actress had sex with him when he was 17 and that he received a $400,000 payout. Larry befriends unpleasant, unattractive city councilwoman Irma Kostroski (Tracey Ullman) after he learns the city council can repeal ordinances; to hopefully change the bylaw for having a fence around your pool, which in turn means he could finally fire Maria Sofia. Larry later goes canvassing with Irma for Mayhew. While waiting in a long line to vote, Larry speaks with a man who is voting for the other candidate and suggests that they just leave because their votes cancel each other. Larry, Susie, Irma and various others attend a gathering at the Mayhew home and the results are announced in which he loses by one vote. Asa reveals to everybody that he saw Larry leave the voting line and everybody begins to angrily approach Larry."
  },
  {
    "episode_id": "(6,5)",
    "source": "wikipedia",
    "text": "Cheryl arranges for her, Larry, Jeff, Susie, Ted Danson and Mary Steenburgen to have burial plots next to each other. Larry attends Ted's birthday party but is bothered by Ted requiring the waiters wear bow ties and by his chauffeur, Charlie, having to wait outside. Things go from bad to worse when Larry stops by the cemetery asking that his burial plot be moved far away from Ted Danson.",
    "word_count": 69,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Cheryl arranges for her, Larry, Jeff, Susie, Ted Danson and Mary Steenburgen to have burial plots next to each other. Larry attends Ted's birthday party but is bothered by Ted requiring the waiters wear bow ties and by his chauffeur, Charlie, having to wait outside. Larry gives Ted a coffee table book about freaks. Charlie is drunk and gropes Mary, so Ted throws him and Larry out and rejects the book. Larry pretends to be Charlie and covers his limo driving shift, driving John McEnroe - who quickly becomes annoyed by Larry asking him many personal questions. Things go from bad to worse when Larry stops by the cemetery asking that his burial plot be moved far away from Ted Danson."
  },
  {
    "episode_id": "(11,3)",
    "source": "wikipedia",
    "text": "They also ask Larry for an audition tape for Maria Sofia. At dinner, Larry's cousin Andy and his wife Cassie sit at the middle of table, which causes problems because they are at the center of attention, boring everyone with their conversation. Larry and Jeff have a meeting at Hulu regarding Young Larry.",
    "word_count": 53,
    "season": "unknown",
    "episode": "unknown",
    "full_text": "Larry and Jeff have a meeting at Hulu regarding Young Larry. Talking about casting, the Hulu executive recommends Ted Danson for the role of Uncle Mo. They also ask Larry for an audition tape for Maria Sofia. Larry asks Cheryl to give Maria Sofia acting lessons and to record an audition tape. At a dinner party at Jeff and Susie's, Larry talks with Freddy Funkhouser, who has bought a hotel and Larry tells him he wants to curate the minibar. At dinner, Larry's cousin Andy and his wife Cassie sit at the middle of table, which causes problems because they are at the center of attention, boring everyone with their conversation. Eventually, Larry and Freddy take over the middle seats and the rest of the dinner party goes smoothly. They talk about taking the advice from someone who has stage 4 cancer and the wisdom they would have. Cheryl tries to film an audition tape for Maria Sofia, but it goes terribly due to Maria Sofia having no acting skills. Larry goes shopping for the minibar and presents it to Freddy and his associates, but they do not like it. Larry and Jeff go to see Marcos at his restaurant, where Jeff pretends to have stage 4 cancer and offers advice to Marcos to not let her daughter become an actor, which he takes. Maria Sofia sees Cheryl again and Maria thinks Cheryl has stolen her jacket after giving her a compliment on it prior. Maria uses this rage while doing a scene and gets into an altercation with her and Ted, all while the camera is still filming. The Hulu executives see the tape and think it is hilarious and cast her in the show."
  }
]